api/app/controllers/clients_controller.rb

SELECT "clients".* FROM "clients"
---
    def index
        render json: Client.all

INSERT INTO "clients" ("name", "phone", "address", "client_type") VALUES (?, ?, ?, ?)  [["name", "CR"], ["phone", "3133557269"], ["address", "kra"], ["client_type", "PROOVEDORES"]]
---
    def create
        Client.create(get_params)

SELECT  "clients".* FROM "clients" WHERE "clients"."client_type" = ? LIMIT ?  [["client_type", "PROVEEDORES"], ["LIMIT", 1]]
---
    def show_suppliers
        render json: Client.where(client_type: 'PROOVEDORES').all

SELECT "clients".* FROM "clients" WHERE "clients"."client_type" = ?  [["client_type", "REGULARES"]]
---
    def show_clients
        render json: Client.where(client_type: 'REGULARES').all