api/app/controllers/inventories_controller.rb

SELECT "inventories".* FROM "inventories"
---
    def index
        render json: Inventory.all

INSERT INTO "products" ("name") VALUES (?)  [["name", "Chaqueta de cuero"]]
INSERT INTO "inventories" ("product_id", "quantity", "retailer_cost", "wholesale_cost") VALUES (?, ?, ?, ?)  [["product_id", 15], ["quantity", 2000], ["retailer_cost", 10000.0], ["wholesale_cost", 50000.0]]
INSERT INTO "inventories" ("product_id", "quantity", "retailer_cost", "wholesale_cost") VALUES (?, ?, ?, ?)  [["product_id", 18], ["quantity", 222], ["retailer_cost", 222222.0], ["wholesale_cost", 22222.0]]
---
    def create
        pms = get_params
        if params.key?("name")
            product = Product.create name: params["name"]
            pms = pms.merge({"product_id": product[:id]})
            Inventory.create(pms)
        else
            Inventory.create(get_params)

SELECT  "inventories".* FROM "inventories" WHERE "inventories"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
    def show
        @inventory = Inventory.find(params[:id])

SELECT  "inventories".* FROM "inventories" WHERE "inventories"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "inventories" SET "quantity" = ?, "retailer_cost" = ?, "wholesale_cost" = ? WHERE "inventories"."id" = ?  [["quantity", 1], ["retailer_cost", 1000.0], ["wholesale_cost", 3999.0], ["id", 2]]
---
    def update
        @inventory = Inventory.find params[:id]
        @inventory.update get_params

SELECT  "inventories".* FROM "inventories" WHERE "inventories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def destroy
        @inventory = Inventory.find(params[:id])

SELECT  "inventories".* FROM "inventories" WHERE "inventories"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "clients_inventories" ("client_id", "inventory_id", "created_at", "city", "address", "phone", "quantity") VALUES (?, ?, ?, ?, ?, ?, ?)
UPDATE "inventories" SET "quantity" = ? WHERE "inventories"."id" = ?  [["quantity", -12], ["id", 1]]
UPDATE "inventories" SET "quantity" = ? WHERE "inventories"."id" = ?  [["quantity", 198], ["id", 1]]
---
    def sell
      raw_params = sell_params

      inventory = Inventory.find(raw_params[:inventory_id])
      quantity = inventory.quantity.to_i - raw_params[:quantity].to_i
      client = ClientsInventory.create(sell_params)
      client.save
      if inventory.update_attributes(quantity: quantity)