api/app/controllers/raw_materials_controller.rb

  def index
    raw_materials = RawMaterial.all
---
SELECT "raw_materials".* FROM "raw_materials"

  def create
    raw_material = RawMaterial.create(raw_material_params)
---
INSERT INTO "raw_materials" ("name", "quantity", "description") VALUES (?, ?, ?)  [["name", "cuerina "], ["quantity", 0], ["description", "roja"]]

  def update
    raw_material = RawMaterial.find(params[:id])
    raw_params = raw_material_params
    p raw_params
    quantity = raw_material.quantity.to_i + raw_params[:quantity].to_i
    client = ClientsRawMaterial.create(raw_material_params_ass)
    client.save
    if raw_material.update_attributes(quantity: quantity)
---
SELECT  "raw_materials".* FROM "raw_materials" WHERE "raw_materials"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
INSERT INTO "clients_raw_materials" ("client_id", "raw_material_id", "arrived_at", "cost") VALUES (?, ?, ?, ?)  [["client_id", 3], ["raw_material_id", 7], ["arrived_at", "2019-10-10 10:10:00"], ["cost", 1234.0]]
UPDATE "raw_materials" SET "quantity" = ? WHERE "raw_materials"."id" = ?  [["quantity", 1234], ["id", 7]]

  def raw_materials_discount
    raw_material = RawMaterial.find(params[:id])
    raw_params = raw_material_params
    quantity = raw_material.quantity.to_i - raw_params[:quantity].to_i

    if raw_material.update_attributes(quantity: quantity)
---
SELECT  "raw_materials".* FROM "raw_materials" WHERE "raw_materials"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "raw_materials" SET "quantity" = ? WHERE "raw_materials"."id" = ?  [["quantity", 1214], ["id", 7]]

  def destroy
    raw_material = RawMaterial.find(params[:id])
    if raw_material.delete
---
SELECT  "raw_materials".* FROM "raw_materials" WHERE "raw_materials"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "raw_materials" WHERE "raw_materials"."id" = ?  [["id", 2]]

  def show
    raw_material = RawMaterial.find(params[:id])
---
SELECT  "raw_materials".* FROM "raw_materials" WHERE "raw_materials"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]