api/app/controllers/raw_materials_controller.rb

  def destroy
    raw_material = RawMaterial.find(params[:id])
    if raw_material.delete
---
DELETE FROM "raw_materials" WHERE "raw_materials"."id" = ?  [["id", 2]]